[
    {
      "_id": "0282e0e58a5c404fbd15261f11c2ab6a",
      "category_id": "01",
      "title": "HTML Basic to Advanced",
      "author": {
        "name": "Azad Ali",
        "published_date": "2022-08-24 17:27:34",
        "img": "https://img.freepik.com/free-photo/young-bearded-man-with-striped-shirt_273609-5677.jpg?w=2000"
      },
      "thumbnail_url": "https://play-lh.googleusercontent.com/85WnuKkqDY4gf6tndeL4_Ng5vgRk7PTfmpI4vHMIosyq6XQ7ZGDXNtYG2s0b09kJMw",
      "details": "HTML or Hypertext Markup Language is necessary for designing the front-end of a website using a markup language. HTML is a combination of markup language and hypertext. Hypertext defines the links between two or more pages. The markup language is necessary for defining the text documentation within the tag, which in turn defines the web page’s structure. HTML is used for of your website. In contrast, CSS creates the page layout, style, fonts, and colors. Knowing HTML, CSS, and JavaScript is essential to become a front-end web developer."
    },
    {
      "_id": "f69a695f037cd9484cecaea37ca71012",
      "category_id": "02",
      "title": "CSS Basic to Advanced",
      "author": {
        "name": "Osman Ali",
        "published_date": "2022-08-24 17:27:34",
        "img": "https://media.gettyimages.com/photos/smiling-man-outdoors-in-the-city-picture-id1179420343?s=612x612"
      },
      "thumbnail_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS4bJcZn1DhxbB02nhIwg5fq1-GY_KnnEscAA&usqp=CAU",
      "details": "Cascading Style Sheets or CSS is a simply designed programming language that helps to simplify the process of making web pages presentable. With CSS, you can apply a style to web pages. Moreover, you can use CSS independently without relying on HTML that makes up each web page. CSS also helps you to redesign redesign websites very quickly. Without the use of extensive coding, CSS supports different-looking web pages. The only thing that changes is the content."
    },
    {
      "_id": "0282e0e58a5c404fbd15261f11c2ab6b",
      "category_id": "03",
      "title": "Bootstrap Basic to Advanced",
      "author": {
        "name": "Mohammod Ali",
        "published_date": "2022-08-24 17:27:34",
        "img": "https://media.istockphoto.com/photos/smiling-indian-man-looking-at-camera-picture-id1270067126?s=170667a"
      },
      "thumbnail_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRyS9VY5uFYyc1xVD9-kmMnjR9DpsbuVpr3Xw&usqp=CAU",
      "details": "Bootstrap is another free and powerful open source framework for the front-end. It has been designed for creating mobile-friendly, responsive, and dynamic websites and applications. Bootstrap includes JavaScript and CSS templates for navigation, buttons, forms, typography, and other essential UI components/elements.This robust toolkit contains CSS, HTML, and JavaScript tools to create front-end design elements for dynamic and responsive websites. It has pre-built components that users can use to add themes and icons to their designs."
    },
    {
      "_id": "e342b6c0c8efc8ca9e811991dc8a7900",
      "category_id": "04",
      "title": "JavaScript Basic to Advanced",
      "author": {
        "name": "Firuj Mia",
        "published_date": "2022-08-24 17:27:34",
        "img": "https://t3.ftcdn.net/jpg/02/00/90/24/360_F_200902415_G4eZ9Ok3Ypd4SZZKjc8nqJyFVp1eOD6V.jpg"
      },
      "thumbnail_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTTP_RBWniG6RLuxBFaaQFguZB9ycs_w6Xbjw&usqp=CAU",
      "details": "You know that JavaScript is essential for front-end development. But, the possibilities of JavaScript are endless. It is one of the most multifaceted programming languages that helps you develop web, desktop, and mobile apps. If you want to become a front-end developer, JavaScript is a prerequisite. With JavaScript, you can make the site interactive for the website user. The programming language enhances the functionality of a website for running web-based software and cool games. By using these graphical methods, the complex client side is represented. For a seamless frontend application, the below technologies are recommended."
    },
    {
      "_id": "f06f8cc035b04bd1158e4198281915a3",
      "category_id": "05",
      "title": "React JS Basic to Advanced",
      "author": {
        "name": "Korim Uddin",
        "published_date": "2022-08-24 17:27:34",
        "img": "https://image.shutterstock.com/image-photo/close-portrait-goodlooking-mature-white-260nw-1929520199.jpg"
      },
      "thumbnail_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSEg3mMpLWo687RGslGWGK55byglXmt6HSAaA&usqp=CAU",
      "details": "React JS, better known as React, is an open-source JavaScript front-end library. It creates interactive and dynamic applications and enhances UX/UI design. React JS is responsible only for the enhancement of the view layer. Check this image to know uses of React JS. With the help of frameworks like Next.JS, React is useful for developing single-page, mobile, and server-side web applications. It allows code to be corrected more efficiently by separating it into components. React JS is designed to support one-way data binding that gives you more control across your application."
    },
    {
      "_id": "4e6092d54c18fbd89ad59e88a1e87fbb",
      "category_id": "06",
      "title": "Angular JS Basic to Advanced",
      "author": {
        "name": "Sahadat Husain",
        "published_date": "2022-08-24 17:27:34",
        "img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTkWzc9ThWQXCAIgUNo0SUkOU2VUhO75AZD2BLEIZ9vCx1rl1EainUjEfFHXAVooKUnU0w&usqp=CAU"
      },
      "thumbnail_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRnjLpvzMbTYNrGmUYFvYZBmMzbFdHdQ3C4Sg&usqp=CAU",
      "details": "Angular JS is also an open-source JavaScript front-end application programming interface that is an essential part of the MEAN stack (MongoDB, Express.JS, Angular JS, and Node.JS). It is mostly used for creating single-page web applications. Here is an image to help you understand the structure of single page application. The web tool has built-in templates that make it easier for front-end developers to create UI views quickly. It provides less navigation and fast loading, ensuring an excellent user experience. Angular applications are not browser-specific; hence there are no browser-specific constraints."
    }
  ]